---
kind: type
id: T:Autodesk.Revit.DB.LogicalAndFilter
source: html/3e334aaf-2b39-58bd-d2cc-94e9c89bac57.htm
---
# Autodesk.Revit.DB.LogicalAndFilter

A filter that contains a set of filters. The filter passes when all filters in the set pass.

## Syntax (C#)
```csharp
public class LogicalAndFilter : ElementLogicalFilter
```

## Remarks
The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.